/*
 *  일차 for , while 
 *  => break;
 *  조건문 : 단일조건문 / 선택조건문
 *  ------------------------------- 필수 공부**
 */
public class 반복제어문_3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		for(int i = 1; i <= 3; i++)
		{
			for(int j =1; j <= 3; j++)
			{
				if(j==2) // j 가 2면 제외
					continue; // while에서 가끔 잘못된 입력이있는 경우
				System.out.println("i="+i+",j="+j);
			}
		}

	}

}
                       /*
                        *  반복문 => 중복제거
                        *  for : 횟수가 지정된 경우 => 웹화면 UI
                        *  for(초기값;조건식;증가식)
                        *  {
                        *     반복수행문장
                        *  }
                        *  => 가장 많이 사용되는 반복문
                        *  => 웹에서는 특별한 경우가 아니면 => 이중 for문을 사용하지 않는다
                        *  => 웹: 송수신
                        *         어떤 값을 보낼지 / 어떤 값을 받을지
                        *         => 연습 : 네트워크 (웹)
                        *  while : 횟수가 지정이 안된 상태 => 데이터베이스 / 파일읽기
                        *  => 먼저 조건을 점색 => 한번도 실행이 안되는 경우가 있다
                        *  
                        *  초기값   --------- 1
                        *  while(조건문) ---- 2
                        *  {
                        *      반복수행문장 -----3
                        *      증가식 ----4 ====> 조건검색 요청 => 2
                        *      => 종료하는 조건은 무조건 작성
                        *            => 게임 : ESC 종료
                        *  }
                        *  
                        *  do~while : while문과 동일하지만 => 후조건 검색
                        *             무조건 한번이상 수행
                        *             
                        *    초기값   --------- 1
                        *    do
                        *  {
                        *      반복수행문장 -----2 => 무조건 문장 한번 수행
                        *      증가식 ----3
                        *   }while(조건식) ----4  
                        *           | false 면 종료  
                        *    
                        *    =반복제어문장
                        *      = break : 반복을 종료시에 사용
                        *                for,while,do~while => 무조건 종료
                        *                => switch, 반복문에서 사용
                        *      = continue : 특정부분을 제외시에 사용
                        *                for ==> 증가식으로 이동
                        *                while ==> 조건식으로 이동 => 무한루프가 걸릴 수 있다
                        *        *** 소속 반복문만 제어
                        *             
                        *             
                        *             
                        *             */
