/*
 *   1. 변수 = 한개만 저장하는 공간 , 변경이 가능
 *          => 1. 메모리 저장 , 2. 값 읽기 , 3. 수정이 가능
 *      ---
 *      1) 지역변수 : 메소드안에서 선언되는 변수
 *      2) 맴버변수
 *      3) 공유변수
 *      -------------------------------------------
 *      => 변수를 저장하기 위해서는 반드시 필요한 내용
 *         -------------------------------
 *         메모리 크기 결정 / 클래스 (JVM에서 크기를 모른다)
 *                                     ---------
 *      
 *      메모리 저장 
 *      ----------------------------------------
 *      MethodArea : Method / static (공유변수)
 *      -----------------------------------------
 *      Stack : 메모리 자체에서 관리 => 지역변수
 *              {}이 종료가 된 경우 사라진다
 *      -------------------------------------------
 *      Heap : 실제 데이터 공간 : 클래스 / 배열
 *             자동으로 해제되지 않는다 => 개발자가 처리
 *             new / delete : => 가비지컬렉션
 *                               자동 메모리 회수
 *             => 메모리 저장
 *                -------- 확인 int malloc()
 *      ------------------------------------------
 *      
 *      ==> 사용자 요청에 따른 데이터 처리
 *      1) 연산자
 *      2) 제어문
 *      ---------- 묶어서 처리 => 메소드 중복제거 
 *      1. 입력
 *      2. 처리 => 세분화
 *      3. 출력 
 *      
 */
import java.util.Scanner;
public class 자바1_3_정리 {
	// 멤버변수 => 자동 초기화  int a; => a=0

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// 지역변수 => 초기화가 안된다 => int a;
//		for(int i = 1; i<=100; i++)
//		{
//			A a=new A();
//			System.out.println("a="+a);
//		}
		Scanner scan = new Scanner(System.in);
		//System.out.println("년도 "+month+"월 " +Date ");
		

	}

}
